Repository: calliope-edu/calliope-mini-flash-app-iOS
Catalog: Calliope App/Localizable.xcstrings
Source language: en
Languages: de

source: - Additionally press the Reset button for 1 second
de: - Reset Taste für 1 Sekunde zusätzlich drücken

source: - An ID pattern appears on the Calliope mini
de: - ID-Muster erscheint auf dem Calliope mini

source: - Confirm the connection by pressing the green button
de: - Verbinden bestätigt über das Drücken der grünen Schaltfläche

source: - From now on, you can transfer programs from the app via Bluetooth
de: - Ab jetzt kannst du Programme aus der App über Bluetooth übertragen

source: - Hold down buttons A+B
de: - Taste A+B gedrückt halten

source: - If the Calliope mini is found, a green button appears
de: - Wird der Calliope mini gefunden erscheint eine grüne Schaltfläche

source: - Keep holding buttons A+B until the Bluetooth animation ends
de: - Tasten A+B gedrückt halten bis die Bluetooth Animation beendet ist

source: - Press the Reset button 3 times
de: - Reset Taste 3x drücken

source: - The connection window opens via the red Calliope mini icon in the Editors and Programs section
de: - Über das rote Calliope mini Icon im Bereich Editoren und Programme öffnet sich das Verbindungsfenster

source: - The program now appears on the Calliope mini
de: - Nun erscheint das Programm auf dem Calliope mini

source: - To transfer a program to the Calliope mini: Download, save, and transfer the program. This may take a few seconds. Progress will be displayed.
de: - Übertragung des Programms an den Calliope mini mit folgenden Schritten: Programm herunterladen, sichern und übertragen. Die Übertragung kann einige Sekunden dauern. Der Fortschritt wird angezeigt.

source: - Transfer the Calliope mini's unique ID pattern to the matrix
de: - Individuelles ID-Muster des Calliope mini auf die Matrix übertragen

source: - Use an editor to create and transfer a program
de: - Verwende einene Editor, um eine Programm zu erstellen und zu übertragen

source: %lld unique locations
de: %lld einzelne Orte

source: 1. Open MakeCode Editor
de: 1. Starte MakeCode.

# 1. Programm 5 starten 2. Schütteln 3. LED-Muster eingeben
source: 1. Press A+B and 1 Sek Reset 2. Keep A+B pressed 3. Transfer ID pattern
de: 1. A+B und 1 Sek Reset 2. A+B gedrückt halten 3. LED-Muster eingeben

source: 1. This template can be used with the extension:
de: 1. Dazu kann dieses Template mit der Erweiterung verwendet werden:

source: 2. Add the Bluetooth extension to your project
de: 2. Lade die Bluetooth-Erweiterung in dein Projekt oder starte das Template:

source: 2. Create the program with the respective data and define the required columns and se tthe corresponding (sensor) data as values.
de: 2. Erstelle das Programm mit den jeweiligen Daten und definiere benötigte Spalten und setze entsprechende (Sensor-)Daten als Werte.

source: 3. Select the disired services for your program to view or record
de: 3. Wähle die gewünschten Dienste für dein Programm aus, um diese anzusehen oder aufzunehmen.

source: 3. Transfer the program to your Calliope mini
de: 3. Übertrage das Programm auf deinen Calliope mini.

source: 4. Open the datalogger view
de: 4. Öffne die Datenlogger Ansicht.

source: 4. Start the program on your Calliope mini
de: 4. Starte das Programm auf deinem Calliope mini.

source: Accelerometer
de: Beschleunigungsmesser

source: Activate Bluetooth!
de: Bitte Bluetooth aktivieren!

source: All
de: Alle

source: An introduction to Scratch programming with the Calliope mini Blocks app, instructions and project ideas can be found on the website.
de: Eine Einführung in die Scratch Programmierung mit der Calliope mini Blocks App, Anleitungen und Projektideen findest du auf der Webseite.

source: Average
de: Durchschnitt

source: Axis
de: Achsen

# bkL-vr-KqE.configuration.title
source: Record Sensordata
de: Sensordaten aufzeichnen

source: Bluetooth deactivated
de: Bluetooth deaktiviert

source: Bluetooth must be activated to send data to Calliope mini!
de: Bluetooth muss aktiviert sein, damit Daten an den Calliope mini gesendet werden können!

source: Brightness
de: Helligkeit

source: Button A
de: Taste A

# Button A and B
source: Button A und B
de: Taste A und B

source: Button B
de: Taste B

# By shaking, you confirm the selection
source: Shake to confirm your selection
de: Bestätige deine Auswahl, indem du den Calliope mini schüttelst

source: Calliope mini 1+2: Download the original program of the Calliope mini 1 and Calliope mini 2. Connect and transfer the program!
de: Calliope mini 1+2: Lade hier das Startprogramm für den Calliope mini 1 und Calliope mini 2. Einfach verbinden und Programm übertragen!

source: Calliope mini 3: Download the original program of the Calliope mini 3. Connect and transfer the program!
de: Calliope mini 3: Lade hier das Startprogramm für den Calliope mini 3. Einfach verbinden und Programm übertragen!

source: Calliope mini Discovery State now: (state)
de: Der Verbindungsstatus zum Calliope mini ist (state)

source: Calliope mini discovery state: (state)
de: Calliope mini Bluetooth Status: (state)

# Calliope mini verbinden!
source: Connect a Calliope mini!
de: Calliope mini verbinden!

source: Calliope mini will start the program as soon as the transmission is complete.
de: Der Calliope mini startet das Programm, sobald die Übertragung beendet ist.

source: Cancel
de: Abbrechen

source: Cannot upload
de: Übertragung nicht möglich

source: Change project name
de: Projectnamen ändern

source: Check your internet connection or the snippets url in settings. The error description is: %@
de: Überprüfe deine Internetverbindung oder die Code-Schnipsel-Url in den Einstellungen. Fehlermedlung: %@

source: Choose File
de: Datei auswählen

# cnw-wD-B2K.title
source: Sensordata
de: Sensorendaten

source: Connect
de: Verbinden

source: Connect a Calliope mini!
de: Calliope mini verbinden!

# Connect to a calliope to finish the tutorial
source: Connect to a Calliope mini to finish the tutorial
de: Verbinde dich hier mit dem Calliope mini.

source: Connect to Bluetooth Calliope mini
de: Verbunden mit dem Calliope mini per Bluetooth

source: Connect to USB Calliope mini
de: Verbunden mit dem Calliope mini per USB!

source: Connect with cable
de: USB Verbindung

source: Connect your calliope mini with the iPad.
de: Verbinde deinen Calliope mini mit dem iPad.

source: Connecting to USB Calliope mini failed
de: Verbindung zum Calliope mini per USB ist fehlgeschlagen!

source: Connection to Calliope lost
de: Verbindung zum Calliope verloren

source: Connection to Calliope mini timed out!
de: Zeitüberschreitung bei der Verbindung mit dem Calliope mini!

source: Connection to calliope timed out!
de: Zeitüberschreitung bei der Übertragung

# Could not find connected calliope in discovered calliopes
source: Could not find connected Calliope mini
de: Es konnte kein Calliope mini gefunden werden

source: Could not find connected Calliope mini in discovered Calliope minis
de: Verbundener Calliope mini konnte nicht gefunden werden!

source: Could not rename %@
de: Konnte nicht umbenannt werden %@

# Could not save file or download is not a proper hex file
source: Could not save or download a hex file
de: Die Datei konnte nicht gesichert oder geladen werden

source: Current
de: Aktuell

source: Data can be recorded on the Calliope mini 3. With the datalogger extension data can be saved in a table and also displayed as a graph.
de: Es können auf dem Calliope mini 3 Daten aufgezeichnet werden. Daten können mit der Erweiterung Datenlogger in einer Tabelle gespeichert und zusätzlich als Grafik dargestellt werden.

source: Datalogger CSV successfully downloaded!
de: Datalogger CSV erfolgreich heruntergeladen!

source: Datalogger Download Failed!
de: Datalogger Download fehlgeschlagen!

source: DataLogger View
de: Datenlogger Ansicht

# Datei geöffnet
source: Opened file
de: Datei geöffnet

source: Delete
de: Löschen

source: Delete failed
de: Löschen fehlgeschlagen

source: Delete?
de: Löschen?

source: Detailed instructions can be found on the website:
de: Detaillierte Anweisungen findest du auf der Webseite:

source: DFU process aborted
de: DFU-Prozess abgebrochen!

# Dgf-wX-T07.text
source: Project Name
de: Projektname

source: Do you want to delete %@?
de: Datei entgültig löschen %@?

source: Do you want to upload %@ to your Calliope mini?
de: Möchtest du %@ auf deinen Calliope mini laden?

source: Don´t save
de: Nicht sichern

source: Download finished
de: Download abgeschlossen

source: Download the Swift Playgrounds App
de: Lade die Swift Playgrounds App

# DTy-e7-oGc.title
source: Sensordata
de: Sensordaten

# Duration: about 10 seconds
source: Takes about 10 seconds
de: Dauer 10 Sek.

source: Encountered an error discovering or connecting calliope:
de: Es ist ein Fehler beim Erkennen oder Verbinden aufgetreten:

source: Enter an Projectname for the new Project
de: Projektnamen eingeben

source: Enter the CSV file name
de: Gib den CSV-Dateinamen ein

source: Enter the new project name
de: Gebe den neuen Projektnamen ein

source: Error
de: Fehler

source: Export (CSV)
de: Exportieren (CSV)

source: Export Data
de: Daten exportieren

source: Failed to download Datalogger CSV!
de: Fehler beim Herunterladen der Datalogger CSV!

source: Failed to download session data!
de: Download fehlgeschlagen!

source: Failed to load snippets
de: Laden der Programm-Schnipsel fehlgeschlagen

source: File already exists
de: Datei existiert bereits

# Finished
source: Done
de: Abgeschlossen

source: First transfer the Scratch program to your Calliope mini to run the Scratch programs directly.
de: Übertrage zuerst das Scratch Startprogramm auf deinen Calliope mini, um die Scratch Programme direkt auszuführen.

source: Flip through the programs by pressing the keys A or B
de: Gehe durch die Programme, indem du die Tasten A und B drückst

source: Further Information
de: Weitere Informationen

# Greetings
source: Welcome
de: Begrüßung

source: Here you will find your projects. You can view, process and share the recorded data, as well as download it as a table.
de: Hier findest du bereits erstellte Projekte. Die aufgenommenen Daten kannst du dir anschauen, weiterverarbeiten und teilen sowie als Tabelle herunterladen.

# https://calliope.cc
source: https://calliope.cc/en
de: https://calliope.cc

# https://calliope.cc/calliope-mini/uebersicht
source: https://calliope.cc/en/calliope-mini/features
de: https://calliope.cc/calliope-mini/uebersicht

# https://calliope.cc/forumassets/news.json
source: https://calliope.cc/forumassets/news_EN.json
de: https://calliope.cc/forumassets/news.json

# https://calliope.cc/programmieren/editoren
source: https://calliope.cc/en/coding/editors
de: https://calliope.cc/programmieren/editoren

# https://calliope.cc/programmieren/mobil
source: https://calliope.cc/en/coding/mobile
de: https://calliope.cc/programmieren/mobil

# https://calliope.cc/programmieren/mobil/hilfe
source: https://calliope.cc/en/coding/mobile/help
de: https://calliope.cc/programmieren/mobil/hilfe

# https://calliope.cc/programmieren/playground
source: https://calliope.cc/en/coding/editors/playground
de: https://calliope.cc/programmieren/editoren/playground

# https://calliope.cc/start/tipps
source: https://calliope.cc/en/start/tips
de: https://calliope.cc/start/tipps

# Kjn-CJ-sdt.title
source: Sensordata
de: Sensordaten

source: Let's get started!
de: Los geht’s!

source: Load the Calliope mini Blocks app from the app store and get started!
de: Lade die Calliope mini Blocks App aus dem App Store und lege direkt lost!

source: Magnetometer
de: Magnetfeldsensor

source: Microphone
de: Mikrofon

# Möchtest du die Datei sichern oder auf deinen Calliope mini übertragen?
source: Do you want to save the file or transfer it to your Calliope mini
de: Möchtest du die Datei sichern oder auf deinen Calliope mini übertragen?

# Multiplication tables
source: 1x1 Multiplication
de: 1x1 Rechner

source: New project
de: Neues Projekt

# nJx-VD-M8y.title
source: Sensors and Projects
de: Sensoren und Projekte

source: No
de: Nein

source: No changes to upload
de: Keine Änderungen zu übertragen

source: No description available
de: Keine Beschreibung verfügbar

source: No root view controller for presenting File Save UI found
de: Kein Root-View-Controller für die Darstellung der File Save UI gefunden

source: No Sensor Available
de: Kein Sensor verfügbar

source: Noise-o-meter
de: Lärm-o-meter

source: Open a program in MakeCode using a QR code. Simply scan it and off you go!
de: Öffne ein Programm in MakeCode über einen QR-Code. Einfach scannen und los geht’s!

source: Open Settings
de: Einstellungen öffnen

source: Oracle
de: Orakel

source: Paper, Rock, Scissor
de: Schere, Stein, Papier

source: Please choose a name
de: Wähle einen Namen

source: Press both A and B to return to the menu
de: Drücke die Tasten A und B, um zum Menü zu gelangen

# Program download failed
source: Download failed
de: Programmübertragung fehlgeschlagen

source: Program exported
de: Program exportiert

# Program exported message
source: The program was saved in the Calliope mini folder on your device.
de: Das Program wurde im Calliope mini Ordner auf dem Gerät gespeichert.

source: Program your Calliope mini with Scratch!
de: Programmiere deinen Calliope mini mit Scratch!

# Push the button and follow the instructions for connecting to your Calliope
source: Display ID pattern on the Calliope mini: Press and hold A+B+Reset, release reset after 1 second. OR: Press Reset 3 Times. More info under "Help“.
de: Muster auf dem Calliope mini anzeigen: V3: Reset Button 3-Mal drücken V2: A+B+Reset gedrückt halten, nach 1 Sekunde Reset loslassen. Weitere Infos unter „Hilfe”.

# Ready!
source: Done!
de: Fertig!

source: Remove paired device
de: Trennen

source: Rename
de: Umbenennen

source: Save and fast upload
de: Speichern und schnelles Übertragen

source: Save and thorough upload
de: Speichern und gründliches Übertragen

# Save Program
source: Save pogram
de: Programm sichern

source: Scan
de: Scannen

source: Scratch is a project of the Scratch Foundation, in collaboration with the Lifelong Kidergarden Group at the MIT Media Lab. It is available for free at https://scratch.mit.edu.
de: Scratch ist ein Projek der Scratch Foundation in Zusammenarbeit mit der Lifelong Kindergarden Group des MIT Media Lab. Es ist kostenlos verfügbar unter https://scratch.mit.edu.

source: seconds
de: Sekunden

source: Select
de: Auswählen

source: Select a program to transfer, share, rename or delete it.
de: Wähle ein Program aus, um es zu übertragen, teilen, umbenennen oder zu löschen.

source: Select Axis
de: Achse Auswählen

source: Select Sensor
de: Sensor Auswählen

source: Send sensor data directly from Calliope mini to the app
de: Sensordaten vom Calliope mini direkt an die App senden

source: Sensors
de: Sensoren

# Service discovery on calliope has timed out!
source: Timeout
de: Zeitüberschreitung

source: Session data successfully downloaded!
de: Download erfolgreich!

source: Shake
de: Schütteln

source: Share
de: Teilen

# Sichern
source: Save
de: Sichern

source: Speaker
de: Lautsprecher

source: Start Bluetooth Mode
de: Bluetooth Modus starten

source: Start program
de: Startprogramm

# Subscribe to the Calliope Playgrounds
source: Subscribe to the Calliope mini Swift Playground
de: Abonniere den Calliope mini Swift Playground

source: Temperature
de: Temperatur

source: The download of the CSV file containing your datalogger data was unsuccessful.
de: Der Download der CSV-Datei mit deinen Datalogger-Daten war nicht erfolgreich.

source: The download of the session data was unsuccessful.
de: Das Herunterladen der Sitzungsdaten ist fehlgeschlagen.

source: The name %@ could not be given to %@. The name for a program must be unique and not empty.
de: Der Name %@ konnte nicht an %@ vergeben werden. Der Name für ein Programm muss eindeutig sein und darf nicht leer sein.

source: the program
de: das Programm

source: The program does not seem to match the version of your Calliope mini. Please check the hardware selection in your editor again.
de: Das Programm scheint nicht zu der Version des Calliope mini zu passen. Bitte überprüfe die Hardware Auswahl in deinem Editor nochmal.

# The program is being downloaded. Please wait a little.
source: Downloading… Please wait a little.
de: Das Programm wird geladen. Einen Augenblick Geduld.

source: The program is downloaded. Do you want to upload it now?
de: Das Programm wurde geladen. Möchtest du es übertragen?

source: The program is not ready. The reason is: %@.
de: Das Programm ist nicht fertig. Der Grund ist: %@.

# There is no connected calliope in DFU mode
source: There is no connected calliope mini
de: Es konnte kein Calliope mini gefunden werden

source: There is no connected Calliope mini in DFU mode
de: Es ist kein Calliope mini im DFU-Modus verbunden

source: There was an issue downloading the datalogger data from your Calliope mini. Please ensure you are connected to the Calliope and try again.
de: Es gab ein Problem beim Herunterladen der Datalogger-Daten von Ihrem Calliope mini. Bitte stelle sicher, dass du mit dem Calliope mini verbunden bist, und versuche es erneut.

source: This Calliope mini can not be connected until you go to the bluetooth settings of your device and "ignore" it.
de: Dieser Calliope mini kann erst verbunden werden, wenn du in den Bluetooth-Einstellungen deines Geräts die Option "ignorieren" wählst.

source: Transfer
de: Übertragen

source: Transfer Program
de: Programm übertragen

source: Transfer program from your iPhone or iPad directly to your Calliope mini or save them in your Calliope mini folder.
de: Übertrage Programme vom iPhone oder iPad direkt auf deinen Calliope mini oder speichere sie in dem Calliope mini Ordner.

source: Transfering Datalogger Data
de: Übertragung der Datalogger-Daten

source: Transmission running
de: Übertragung läuft

source: Upload
de: Übertragen

source: Upload failed
de: Übertragen fehlgeschlagen

source: Upload failed!
de: Übertragung fehlgeschlagen

# Upload the start program to your Calliope
source: Upload the Start program to your Calliope mini
de: Übertrag das Startprogramm auf den Calliope mini

source: Upload?
de: Übertragen?

source: Uploading…
de: Übertragung läuft…

source: User defined (UART)
de: Benutzerdefiniert (UART)

# Wait a little
source: One moment please
de: Einen Moment bitte

source: Wrong storage location
de: Falscher Speicherort

# xWF-af-2iy.title
source: Project Overview
de: Projektübersicht

source: Yes
de: Ja

# You are connected to your Calliope, well done!
source: Yeah, you are connected to your Calliope mini, well done! Let's continue!
de: Yeah, du bist verbunden - super gemacht! Weiter geht's!

source: You are offline. However, we have some information for you!
de: Du bist leider offline. Dennoch haben wir ein paar Informationen für dich!

source: You can find the CSV file containing your datalogger data, named MY_DATA.csv, in the Calliope directory on your device.
de: Du findest die CSV-Datei mit den Datalogger-Daten im Calliope-Verzeichnis auf deinem Gerät, unter den namen MY_DATA.csv

source: You can find the session data, in the Calliope directory on your device.
de: Du kannst die Sitzungsdaten im Calliope-Verzeichnis auf deinem Gerät finden.

source: You can program your Calliope mini with the help of the editors.
de: Mit Hilfe der Editoren kannst du deinen Calliope mini programmieren.

source: You have not selected a Calliope folder as storage location
de: Du hast keinen Calliope-Ordner als Speicherort gewählt
